
import { IApi, IApiProductsResponse, IProduct } from "../../types";

export class ApiAdapter {
    private _api: IApi;

    constructor(api: IApi) {
        this._api = api;
    }

    async getProducts(): Promise<IProduct[]> {
        try {
            return (await this._api.get<IApiProductsResponse>('/product')).items;
        } catch (err) {
            console.error('Ошибка:', err);
        }
        return [];
    }

    // NOTE
    // По тексту задания указано следующее:
    //
    // ----------------------------------------------------
    // Данные для отправки заказа вы будете собирать во второй части проектной работы, а вот массив товаров нужно получить сейчас
    // ----------------------------------------------------
    //
    // Также указано:
    //
    // ----------------------------------------------------
    // Функциональность, заявленная в задании, работает корректно
    // Создаются экземпляры всех классов - моделей данных.
    // В консоль выводится результат работы всех методов созданных классов:
    // Вывод данных в консоль сопровождается комментарием относительно выводимых данных;
    // выполняется проверка корректной работы всех методов классов работы с данными путем их вызова и отображения результата в консоли;
    // после запроса к серверу, массив товаров сохраняется в класс, отвечающий за каталог товаров и выводится в консоль.
    // ----------------------------------------------------
    //
    // Поэтому логика работы с оформлением заказа не была реализована.
}